dct_1 = {}



type(dct_1)
dct_2 = dict()



type(dct_2)
tpl_2 = 'жара', 912, 0.7, True
tpl_2[0]
dct_1 = {

    0:'жара', 

    1:912, 

    2:0.7, 

    3:True

}
dct_1[0]
dct_1[3]
dct_1 = {

    'погода':'жара', 

    'давление':912, 

    'осадки в мм':0.7, 

    'штиль':True,

}



dct_1
dct_1['погода']
'погода' in dct_1
'жара' in dct_1
dct_1 = {

    'погода':'жара', 

    'давление':912, 

    'осадки в мм':0.7, 

    'штиль':True,

    'температура':['+1','+4','+2','0'],

}
a = 'жара'

hash(a)
dct_1 = {

    'погода':'жара', 

    (1, 4, 'погода'):912, 

    712:['+1','+4','+2','0'],

    True:3.4

}
dct_1 = {

    'погода':'жара', 

    [1, 4, 'погода']:912, 

    712:['+1','+4','+2','0'],

}
dct_2 = {

    'погода':'жара', 

    dct_1:912, 

    712:['+1','+4','+2','0'],

}
dct_1 = {

    'погода':'жара', 

    (1, 4, ['погода']):912, 

    712:['+1','+4','+2','0'],

}
dct_1 = {

    'погода':'жара', 

    'погода':912, 

    712:['+1','+4','+2','0'],

}



dct_1
dct_1 = {

    'погода':'жара', 

    'погода_2':'жара', 

}



dct_1